
## Plan Result

[CI link](https://github.com/clov3r-cc/infra/actions/runs/13113338377)


<pre><code>Plan: 7 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * cloudflare_dns_record.homepage
  * cloudflare_dns_record.homepage__www
  * cloudflare_pages_domain.clov3r-cc
  * cloudflare_pages_domain.www-clov3r-cc
  * cloudflare_zero_trust_access_application.pxmx01-mng
  * cloudflare_zero_trust_access_group.allow_github
  * cloudflare_zero_trust_access_policy.allow_github


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_dns_record.homepage will be created
  + resource "cloudflare_dns_record" "homepage" {
      + comment             = "for my homepage in Cloudflare Pages"
      + comment_modified_on = (known after apply)
      + content             = "my-home.pages.dev"
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "clov3r.cc"
      + proxiable           = (known after apply)
      + proxied             = true
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "b52fd73ec52e35fea1807a173e33e93a"
    }

  # cloudflare_dns_record.homepage__www will be created
  + resource "cloudflare_dns_record" "homepage__www" {
      + comment             = "for my homepage in Cloudflare Pages"
      + comment_modified_on = (known after apply)
      + content             = "my-home.pages.dev"
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "www"
      + proxiable           = (known after apply)
      + proxied             = true
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "b52fd73ec52e35fea1807a173e33e93a"
    }

  # cloudflare_pages_domain.clov3r-cc will be created
  + resource "cloudflare_pages_domain" "clov3r-cc" {
      + account_id            = "fff06038a70892193e0fa1e9e270436a"
      + certificate_authority = (known after apply)
      + created_on            = (known after apply)
      + domain_id             = (known after apply)
      + id                    = (known after apply)
      + name                  = "clov3r.cc"
      + project_name          = "my-home"
      + status                = (known after apply)
      + validation_data       = (known after apply)
      + verification_data     = (known after apply)
      + zone_tag              = (known after apply)
    }

  # cloudflare_pages_domain.www-clov3r-cc will be created
  + resource "cloudflare_pages_domain" "www-clov3r-cc" {
      + account_id            = "fff06038a70892193e0fa1e9e270436a"
      + certificate_authority = (known after apply)
      + created_on            = (known after apply)
      + domain_id             = (known after apply)
      + id                    = (known after apply)
      + name                  = "www.clov3r.cc"
      + project_name          = "my-home"
      + status                = (known after apply)
      + validation_data       = (known after apply)
      + verification_data     = (known after apply)
      + zone_tag              = (known after apply)
    }

  # cloudflare_zero_trust_access_application.pxmx01-mng will be created
  + resource "cloudflare_zero_trust_access_application" "pxmx01-mng" {
      + app_launcher_visible         = true
      + aud                          = (known after apply)
      + auto_redirect_to_identity    = false
      + cors_headers                 = (known after apply)
      + created_at                   = (known after apply)
      + destinations                 = (known after apply)
      + domain                       = "pxmx01-mng"
      + enable_binding_cookie        = false
      + footer_links                 = (known after apply)
      + http_only_cookie_attribute   = true
      + id                           = (known after apply)
      + landing_page_design          = (known after apply)
      + name                         = "Access application for pxmx01-mng"
      + path_cookie_attribute        = false
      + policies                     = [
          + {
              + connection_rules = (known after apply)
              + exclude          = (known after apply)
              + id               = (known after apply)
              + include          = (known after apply)
              + precedence       = 1
              + require          = (known after apply)
            },
          + {
              + connection_rules = (known after apply)
              + exclude          = (known after apply)
              + id               = "24688b5e-f084-4bc2-8671-1fa1c380bb24"
              + include          = (known after apply)
              + precedence       = 2
              + require          = (known after apply)
            },
        ]
      + saas_app                     = (known after apply)
      + scim_config                  = (known after apply)
      + session_duration             = "24h"
      + skip_app_launcher_login_page = false
      + target_criteria              = (known after apply)
      + updated_at                   = (known after apply)
      + zone_id                      = "b52fd73ec52e35fea1807a173e33e93a"
    }

  # cloudflare_zero_trust_access_group.allow_github will be created
  + resource "cloudflare_zero_trust_access_group" "allow_github" {
      + created_at = (known after apply)
      + exclude    = (known after apply)
      + id         = (known after apply)
      + include    = [
          + {},
        ]
      + name       = "Allow GitHub"
      + require    = (known after apply)
      + updated_at = (known after apply)
      + zone_id    = "b52fd73ec52e35fea1807a173e33e93a"
    }

  # cloudflare_zero_trust_access_policy.allow_github will be created
  + resource "cloudflare_zero_trust_access_policy" "allow_github" {
      + account_id                     = "fff06038a70892193e0fa1e9e270436a"
      + app_count                      = (known after apply)
      + approval_groups                = (known after apply)
      + approval_required              = false
      + created_at                     = (known after apply)
      + decision                       = "allow"
      + exclude                        = (known after apply)
      + id                             = (known after apply)
      + include                        = [
          + {
              + group = {
                  + id = (known after apply)
                }
            },
        ]
      + isolation_required             = false
      + name                           = "To SSO with GitHub"
      + purpose_justification_required = false
      + require                        = (known after apply)
      + reusable                       = (known after apply)
      + session_duration               = "24h"
      + updated_at                     = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Warning: Resource not found

  with cloudflare_zero_trust_access_group.allow_github,
  on cloudflare_zero_trust.tf line 1, in resource "cloudflare_zero_trust_access_group" "allow_github":
   1: resource "cloudflare_zero_trust_access_group" "allow_github" {

The resource was not found on the server and will be removed from state.

(and 2 more similar warnings elsewhere)
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # cloudflare_zero_trust_access_group.allow_github has been deleted
  - resource "cloudflare_zero_trust_access_group" "allow_github" {
      - id         = "8c27e147-4bf7-4e1e-b90b-6c2fac408f61" -> null
        name       = "test"
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>


## :warning: Warnings

```hcl
Warning: Resource not found

  with cloudflare_zero_trust_access_group.allow_github,
  on cloudflare_zero_trust.tf line 1, in resource "cloudflare_zero_trust_access_group" "allow_github":
   1: resource "cloudflare_zero_trust_access_group" "allow_github" {

The resource was not found on the server and will be removed from state.

(and 2 more similar warnings elsewhere)
```



<!-- github-comment: {"Command":"plan","JobName":"tf_plan","PRNumber":67,"Program":"tfcmt","SHA1":"dc7da4db0f19ab5f1a01d8c46968dcbf7daaf867","Vars":{},"WorkflowName":"Terraform CI"} -->